app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_anggota`
---
    public function TotalAnggota()
    {
        return $this->db->table('tbl_anggota')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_buku`
---
    public function TotalBuku()
    {
        return $this->db->table('tbl_buku')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_ebook`
---
    public function TotalEbook()
    {
        return $this->db->table('tbl_ebook')->countAll();