app/Models/ModelPenerbit.php

SELECT *
FROM `tbl_penerbit`
ORDER BY `id_penerbit` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_penerbit')
        ->orderBy('id_penerbit', 'DESC')
        ->get()->getResultArray();