app/Models/ModelAnggota.php

    public function AllData()
    {
        return $this->db->table('tbl_anggota')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi = tbl_anggota.id_prodi', 'left')
            ->orderBy('id_anggota', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_anggota`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi` = `tbl_anggota`.`id_prodi`
ORDER BY `id_anggota` ASC