app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
ORDER BY `id_user` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_user')
        ->orderBy('id_user', 'DESC')
        ->get()->getResultArray();