app/Models/ModelPenulis.php

SELECT *
FROM `tbl_penulis`
ORDER BY `id_penulis` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_penulis')
        ->orderBy('id_penulis', 'DESC')
        ->get()->getResultArray();