app/Models/ModelRak.php

    public function AllData()
    {
        return $this->db->table('tbl_rak')
        ->orderBy('id_rak', 'DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_rak`
ORDER BY `id_rak` DESC