app/Models/ModelPeminjaman.php

    public function PengajuanMasuk()
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_peminjaman.id_anggota', 'left')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi = tbl_anggota.id_prodi', 'left')
            ->where('status_pinjam', 'Diajukan')
            ->selectCount('tbl_peminjaman.id_anggota', 'qty')
            ->select('tbl_anggota.id_anggota,tbl_anggota.nim,tbl_anggota.nama,tbl_anggota.foto,tbl_prodi.nama_prodi')
            ->groupBy('tbl_peminjaman.id_anggota')
            ->get()->getResultArray();
---
SELECT COUNT(`tbl_peminjaman`.`id_anggota`) AS `qty`, `tbl_anggota`.`id_anggota`, `tbl_anggota`.`nim`, `tbl_anggota`.`nama`, `tbl_anggota`.`foto`, `tbl_prodi`.`nama_prodi`
FROM `tbl_peminjaman`
LEFT JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_peminjaman`.`id_anggota`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi` = `tbl_anggota`.`id_prodi`
WHERE `status_pinjam` = 'Diajukan'
GROUP BY `tbl_peminjaman`.`id_anggota`

    public function EditData($data)
    {
        $this->db->table('tbl_peminjaman')
            ->where('id_pinjam', $data['id_pinjam'])
            ->update($data);
---
UPDATE `tbl_peminjaman` SET `id_pinjam` = '9', `status_pinjam` = 'Diterima'
WHERE `id_pinjam` = '9'

    public function PengajuanDiterima()
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_peminjaman.id_anggota', 'left')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi = tbl_anggota.id_prodi', 'left')
            ->where('status_pinjam', 'Diterima')
            ->selectCount('tbl_peminjaman.id_anggota', 'qty')
            ->select('tbl_anggota.id_anggota,tbl_anggota.nim,tbl_anggota.nama,tbl_anggota.foto,tbl_prodi.nama_prodi')
            ->groupBy('tbl_peminjaman.id_anggota')
            ->get()->getResultArray();
---
SELECT COUNT(`tbl_peminjaman`.`id_anggota`) AS `qty`, `tbl_anggota`.`id_anggota`, `tbl_anggota`.`nim`, `tbl_anggota`.`nama`, `tbl_anggota`.`foto`, `tbl_prodi`.`nama_prodi`
FROM `tbl_peminjaman`
LEFT JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_peminjaman`.`id_anggota`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi` = `tbl_anggota`.`id_prodi`
WHERE `status_pinjam` = 'Diterima'
GROUP BY `tbl_peminjaman`.`id_anggota`