app/Models/ModelProdi.php

SELECT *
FROM `tbl_prodi`
ORDER BY `id_prodi` ASC
---
    public function AllData()
    {
        return $this->db->table('tbl_prodi')
        ->orderBy('id_prodi', 'ASC')
        ->get()->getResultArray();